brew "ca-certificates"
brew "sqlite"
brew "libyaml"
brew "aider"
brew "asciinema"
brew "atuin"
brew "autoconf"
brew "aws-sso-cli"
brew "awscli"
brew "bash"
brew "bat"
brew "difftastic"
brew "duti"
brew "elixir-ls"
brew "exiftool"
brew "eza"
brew "fd"
brew "libsodium"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fisher"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gh"
brew "gist"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnupg"
brew "guetzli"
brew "htmlq"
brew "imagemagick"
brew "iperf3"
brew "jj"
brew "jq"
brew "jsonpp"
brew "libpq"
brew "mas"
brew "mkcert"
brew "moreutils"
brew "mplayer"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "node"
brew "nss"
brew "pinentry-mac"
brew "postgresql@16", restart_service: :changed
brew "qsv"
brew "redis", restart_service: :changed
brew "repomix"
brew "ripgrep"
brew "ruby"
brew "s3cmd"
brew "slackcat"
brew "sox"
brew "sponge", link: false
brew "ssh-copy-id"
brew "telnet"
brew "tmux"
brew "transmission-cli"
brew "trash"
brew "tree"
brew "watch"
brew "wget"
brew "xmlstarlet"
brew "yq"
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "acorn"
cask "apparency"
cask "appcleaner"
cask "arc"
cask "arq"
cask "audacity"
cask "backuploupe"
cask "bambu-studio"
cask "chatgpt"
cask "claude"
cask "coconutbattery"
cask "cursor"
cask "customshortcuts"
cask "dictionaries"
cask "discord"
cask "eloston-chromium", args: { appdir: "/Applications" }
cask "fantastical"
cask "figma"
cask "filebot"
cask "finbar"
cask "firefox", args: { appdir: "/Applications" }
cask "font-anonymous-pro"
cask "font-atkinson-hyperlegible"
cask "font-cascadia-mono"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-hack"
cask "font-hasklig"
cask "font-hubot-sans"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-input"
cask "font-inter"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-lilex"
cask "font-mona-sans"
cask "font-monoid"
cask "font-new-york"
cask "font-roboto"
cask "font-roboto-serif"
cask "font-roboto-slab"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-source-code-pro"
cask "font-space-mono"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono"
cask "font-victor-mono"
cask "ghostty"
cask "handbrake"
cask "homerow"
cask "iina"
cask "imageoptim"
cask "key-codes"
cask "launchbar"
cask "launchcontrol"
cask "ledger-live"
cask "livebook"
cask "macwhisper"
cask "mimestream"
cask "monodraw"
cask "multiviewer-for-f1"
cask "musicbrainz-picard"
cask "orbstack"
cask "powerphotos"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "rar"
cask "rectangle-pro"
cask "reflect"
cask "resolutionator"
cask "screenflick"
cask "session-manager-plugin"
cask "setapp"
cask "spotify"
cask "superduper"
cask "suspicious-package"
cask "timemachineeditor"
cask "transmit"
cask "tuple"
cask "vlc"
cask "zed"
cask "zoom"
mas "Avenue", id: 1523681067
mas "Banish", id: 1639049780
mas "Cardhop", id: 1290358394
mas "Color Picker", id: 1545870783
mas "CotEditor", id: 1024640650
mas "DaisyDisk", id: 411643860
mas "Darkroom", id: 953286746
mas "Drafts", id: 1435957248
mas "Endel", id: 1346247457
mas "Focus for YouTube", id: 1514703160
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "GIFwrapped", id: 782319880
mas "Googly Eyes", id: 6743048714
mas "GPX Viewer", id: 920631838
mas "Hyperduck", id: 6444667067
mas "Hyperspace", id: 6739505345
mas "Ice Cubes", id: 6444915884
mas "iMovie", id: 408981434
mas "Kagi for Safari", id: 1622835804
mas "Keynote", id: 409183694
mas "LilyView", id: 529490330
mas "Link Unshortener", id: 1506953658
mas "LookUp", id: 872564448
mas "Lungo", id: 1263070803
mas "Magic Lasso", id: 1198047227
mas "MakePass", id: 1450989464
mas "Mela", id: 1568924476
mas "Metapho", id: 914457352
mas "Mic Drop", id: 1489816366
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Parcel", id: 639968404
mas "Peek", id: 1554235898
mas "Pixelmator Pro", id: 1289583905
mas "Plain Text Editor", id: 1572202501
mas "Save to Reflect", id: 1590481717
mas "Shareful", id: 1522267256
mas "Slack", id: 803453959
mas "Speediness", id: 1596706466
mas "StopTheMadness Pro", id: 6471380298
mas "Super Agent", id: 1568262835
mas "Supercopy", id: 6477720316
mas "Tailscale", id: 1475387142
mas "Taska", id: 6741809383
mas "Things", id: 904280696
mas "UTM", id: 1538878817
mas "Velja", id: 1607635845
mas "xScope", id: 889428659
vscode "bmalehorn.vscode-fish"
vscode "castwide.solargraph"
vscode "denoland.vscode-deno"
vscode "hverlin.mise-vscode"
vscode "jakebecker.elixir-ls"
vscode "jjk.jjk"
vscode "matthewpi.caddyfile-support"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "shopify.ruby-lsp"
vscode "svelte.svelte-vscode"
vscode "t-mrt.copy-github-url"
vscode "tamasfe.even-better-toml"
vscode "visualjj.visualjj"
vscode "vscodevim.vim"
vscode "vsuhanov.rename-current-file"
vscode "vue.volar"
