# # Global Brewfile
#
# Install with:
#
#     $ `brew bundle --global`
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'fish'

brew 'neovim'
brew 'ripgrep'

brew 'git'
brew 'git-delta'

# Install these casks early on
cask '1password', args: { appdir: '/Applications' }
cask 'launchbar'
cask 'xquartz'


brew 'autoconf'
brew 'awscli'
brew 'browser'
brew 'ca-certificates'
brew 'direnv'
brew 'elixir'
brew 'elixir-ls'
brew 'erlang'
brew 'exiftool'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'gh'
brew 'gist'
brew 'gnupg' 
brew 'gpg'
brew 'guetzli'
brew 'hub'
brew 'imagemagick'
brew 'jdxcode/tap/rtx'
brew 'jq'
brew 'jsonpp'
brew 'libsodium'
brew 'mkcert'
brew 'mplayer'
brew 'nss'
brew 'pinentry-mac'
brew 's3cmd'
brew 'slackcat'
brew 'ssh-copy-id'
brew 'stow'
brew 'superfly/tap/flyctl'
brew 'svn' # required by some casks
brew 'switchaudio-osx'
brew 'synfinatic/aws-sso-cli/aws-sso-cli'
brew 'tailscale'
brew 'telnet'
brew 'terraform'
brew 'transmission-cli'
brew 'trash'
brew 'tree'
brew 'tylerbrock/saw/saw'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'yq'
brew 'yt-dlp'

# Run multiple pg versions
brew 'petere/postgresql/postgresql-common'
# - Install a specific version: brew install petere/postgresql/postgresql@14
# - Initialize with `pg_createcluster 14 main --start -p <port>`
# - Start with `pg_ctlcluster 14 main start`
# - Check with `pg_lsclusters`

cask '1password-cli'
cask 'ace-link'
cask 'acorn'
cask 'appcleaner'
cask 'arq'
cask 'backuploupe'
cask 'charles'
cask 'dictionaries'
cask 'discord'
cask 'docker'
cask 'fantastical'
cask 'filebot'
cask 'fluid'
cask 'github'
cask 'grammarly'
cask 'handbrake'
cask 'hazel'
cask 'iina'
cask 'imagealpha'
cask 'imageoptim'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'key-codes'
cask 'keyboard-lock'
cask 'keycastr'
cask 'kindle'
cask 'kitty'
cask 'launchcontrol'
cask 'ledger-live'
cask 'letter-opener'
cask 'loopback'
cask 'mic-drop'
cask 'mimestream'
cask 'monodraw'
cask 'musicbrainz-picard'
cask 'plex'
cask 'poedit'
cask 'rar'
cask 'reflect'
cask 'resolutionator'
cask 'retrobatch'
cask 'screenflick'
cask 'screens'
cask 'setapp'
cask 'shortcutdetective'
cask 'soulver'
cask 'soundsource'
cask 'superduper'
cask 'suspicious-package'
cask 'swiftdefaultappsprefpane'
cask 'timemachineeditor'
cask 'transmit'
cask 'tuple'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'

# Browsers need to reside in /Applications to get 1Password support
cask 'firefox', args: { appdir: '/Applications' }
cask 'eloston-chromium', args: { appdir: '/Applications' }


brew 'mas'

mas '1Keyboard', id: 766939888
mas 'Cardhop', id: 1290358394
mas 'Cascable Transfer', id: 1440801586
mas 'DaisyDisk', id: 411643860
mas 'Darkroom: Photo & Video Editor', id: 953286746
mas 'Diagrams', id: 1276248849
mas 'Drafts', id: 1435957248
mas 'GIF Brewery 3', id: 1081413713
mas 'Gapplin', id: 768053424 # svg preview
mas 'Gifski', id: 1351639930
mas 'Jiffy', id: 1502527999
mas 'Keyword Search', id: 1558453954  
mas 'LilyView', id: 529490330
mas 'Link Unshortener', id: 1506953658
mas 'LookUp: English Dictionary', id: 1476163639
mas 'MakePass: Barcode to Wallet', id: 1450989464
mas 'Mela – Recipe Manager', id: 1568924476
mas 'MsgFiler', id: 418778021  
mas 'Pandan', id: 1569600264
mas 'Peek', id: 1554235898
mas 'Pixelmator Pro', id: 1289583905
mas 'Shareful', id: 1522267256
mas 'Slack', id: 803453959
mas 'Soulver 2', id: 413965349
mas 'Soulver 3', id: 1508732804
mas 'Speediness', id: 1596706466
mas 'StopTheMadness', id: 1376402589
mas 'Super Agent for Safari', id: 1568262835  
mas 'Tailscale', id: 1475387142  
mas 'TestFlight', id: 899247664
mas 'Things 3', id: 904280696
mas 'ToothFairy', id: 1191449274
mas 'Twitterrific: Tweet Your Way', id: 1289378661
mas 'Vectornator: Vector Design', id: 1219074514
mas 'xScope', id: 889428659


# ## QuickLook plugins
#
# <https://github.com/sindresorhus/quick-look-plugins>

cask 'ql-ansilove'
cask 'qladdict'
cask 'qlcolorcode'
cask 'qlcommonmark'
cask 'qlimagesize' 
cask 'qlmarkdown'
cask 'qlmobi'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'


# ## Fonts

tap 'homebrew/cask-fonts'

"ask 'font-symbols-only-nerd-font'

cask 'font-anonymous-pro'
cask 'font-atkinson-hyperlegible'
cask 'font-cascadia-mono'
cask 'font-fantasque-sans-mono'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-hasklig'
cask 'font-hubot-sans'
cask 'font-ibm-plex-mono'
cask 'font-inconsolata'
cask 'font-input'
cask 'font-inter'
cask 'font-iosevka'
cask 'font-jetbrains-mono'
cask 'font-mona-sans'
cask 'font-monoid'
cask 'font-new-york'
cask 'font-roboto'
cask 'font-roboto-serif'
cask 'font-roboto-slab'
cask 'font-sf-compact'
cask 'font-sf-mono'
cask 'font-sf-pro'
cask 'font-source-code-pro'
cask 'font-space-mono'
cask 'font-ubuntu-mono'
cask 'font-victor-mono'
