# Note on QuickLook plugins
#
# See instructions for removing the quarantine attribute:
# <https://github.com/sindresorhus/quick-look-plugins>

tap "homebrew/bundle"
tap "homebrew/cask"
brew "atuin"
brew "autoconf"
brew "aws-sso-cli"
brew "ca-certificates"
brew "awscli"
brew "exiftool"
brew "eza"
brew "fd"
brew "libsodium"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fzf"
brew "gh"
brew "gist"
brew "git"
brew "git-delta"
brew "gnupg"
brew "guetzli"
brew "hub"
brew "imagemagick"
brew "jj"
brew "jq"
brew "jsonpp"
brew "libpq"
brew "libyaml"
brew "mas"
brew "mkcert"
brew "moreutils"
brew "mplayer"
brew "neovim"
brew "nss"
brew "pinentry-mac"
brew "ripgrep"
brew "s3cmd"
brew "slackcat"
brew "sponge", link: false
brew "ssh-copy-id"
brew "starship"
brew "telnet"
brew "tmux"
brew "transmission-cli"
brew "trash"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
brew "yt-dlp"
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "ace-link"
cask "acorn"
cask "apparency"
cask "appcleaner"
cask "arc"
cask "arq"
cask "backuploupe"
cask "charles"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "cursor"
cask "dictionaries"
cask "discord"
cask "docker"
cask "eloston-chromium", args: { appdir: "/Applications" }
cask "fantastical"
cask "filebot"
cask "firefox", args: { appdir: "/Applications" }
cask "font-anonymous-pro"
cask "font-atkinson-hyperlegible"
cask "font-cascadia-mono"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-hack"
cask "font-hasklig"
cask "font-hubot-sans"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-input"
cask "font-inter"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-mona-sans"
cask "font-monoid"
cask "font-new-york"
cask "font-roboto"
cask "font-roboto-serif"
cask "font-roboto-slab"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-source-code-pro"
cask "font-space-mono"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono"
cask "font-victor-mono"
cask "github"
cask "handbrake"
cask "hazel"
cask "iina"
cask "imageoptim"
cask "key-codes"
cask "keyboard-cleaner"
cask "launchbar"
cask "launchcontrol"
cask "ledger-live"
cask "mimestream"
cask "monodraw"
cask "musicbrainz-picard"
cask "openvpn-connect"
cask "orcaslicer"
cask "powerphotos"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "rar"
cask "reflect"
cask "resolutionator"
cask "screenflick"
cask "setapp"
cask "shortcutdetective"
cask "soulver"
cask "spotify"
cask "superduper"
cask "suspicious-package"
cask "timemachineeditor"
cask "transmit"
cask "tuple"
cask "vlc"
cask "windsurf"
mas "Banish", id: 1639049780
mas "Cardhop", id: 1290358394
mas "com.kagimacOS.Kagi-Search", id: 1622835804
mas "CotEditor", id: 1024640650
mas "DaisyDisk", id: 411643860
mas "Darkroom", id: 953286746
mas "Drafts", id: 1435957248
mas "GIF Brewery 3", id: 1081413713
mas "Focus for YouTube", id: 1514703160
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Hyperduck", id: 6444667067
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LilyView", id: 529490330
mas "Link Unshortener", id: 1506953658
mas "LookUp: English Dictionary", id: 1476163639
mas "Magic Lasso", id: 1198047227
mas "MakePass", id: 1450989464
mas "Mela", id: 1568924476
mas "Mic Drop", id: 1489816366
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Peek", id: 1554235898
mas "Pixelmator Pro", id: 1289583905
mas "Plain Text Editor", id: 1572202501
mas "Save to Reflect", id: 1590481717
mas "Shareful", id: 1522267256
mas "Slack", id: 803453959
mas "Soulver 3", id: 1508732804
mas "Speediness", id: 1596706466
mas "StopTheMadness Pro", id: 6471380298
mas "Super Agent", id: 1568262835
mas "Supercopy", id: 6477720316
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
mas "Velja", id: 1607635845
mas "xScope", id: 889428659
