tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'petere/postgresql'

brew 'fish'
brew 'tmux'
brew 'reattach-to-user-namespace'

brew 'vim'
brew 'the_silver_searcher'
brew 'selecta'

brew 'direnv'
brew 'chruby'

brew 'git'
brew 'gist'
brew 'hub'

brew 'elixir'

brew 'browser'
brew 'imagemagick'
brew 'ffmpeg'
brew 'jsonpp'
brew 'mas'
brew 'mplayer'
brew 'phantomjs'
brew 's3cmd'
brew 'slackcat'
brew 'ssh-copy-id'
brew 'switchaudio-osx'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'petere/postgresql/postgresql-9.4'

cask '0xed'
cask 'app-cleaner'
cask 'backuploupe'
cask 'bartender'
cask 'beamer'
cask 'beardedspice'
cask 'cloak'
cask 'cyberduck'
cask 'dropbox'
cask 'github'
cask 'handbrake'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'keyboard-cleaner'
cask 'ksdiff'
cask 'launchcontrol'
cask 'macvim'
cask 'mailplane'
cask 'namebench'
cask 'qlstephen'
cask 'rcdefaultapp'
cask 'shortcat'
cask 'slack'
cask 'super-duper'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'vlc'
cask 'caskroom/versions/google-chrome-canary', args: { appdir: '/Applications' }

mas 'Slicy', id: 512533449 
mas 'Transmit', id: 403388562 
mas 'Kaleidoscope', id: 587512244 
mas 'Annotate', id: 918207447 
mas 'Aware', id: 1082170746 
mas 'Soulver', id: 413965349 
mas 'xScope', id: 889428659 
mas 'Calca', id: 635758264 
mas 'Dash', id: 449589707 
mas 'Divvy', id: 413857545 
mas 'Screens', id: 446107677 
mas 'iMovie', id: 408981434 
mas 'Paprika Recipe Manager', id: 451907568 
mas 'Napkin', id: 581789185 
mas 'ColorSnapper2', id: 969418666 
mas '1Password', id: 443987910 
mas 'Things', id: 407951449 
mas 'DaisyDisk', id: 411643860 
mas 'Xcode', id: 497799835 
mas '1Keyboard', id: 766939888 
mas 'LilyView', id: 529490330 
mas 'Acorn', id: 1019272813 
mas 'GIF Brewery 3', id: 1081413713 
mas 'Pages', id: 409201541 
mas 'iPulse', id: 1028916583 
mas 'Numbers', id: 409203825 
mas 'Gemini', id: 463541543 
mas 'Fantastical 2', id: 975937182 
mas 'WebCode', id: 570644822 
mas 'Melo', id: 483104510 
mas 'Pixelmator', id: 407963104 
mas 'Keynote', id: 409183694 
mas 'PopClip', id: 445189367 
mas 'Tweetbot', id: 557168941 
